src/cf/InformationRegisters/СлужебныеФайлыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СлужебныеФайлыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отношение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношенияСлужебныхФайлов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Comment>Служебный файл - HTML, Отметка, Визуализация, и т.п.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ОтношенияСлужебныхФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ОтношенияСлужебныхФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTMLСодержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Картинка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФайлПункта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФайлПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтметкаЭП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационныйШтампОрганизации</Name>
					<Comment>Регистрационный штамп нашей организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационныйШтампКорреспондента</Name>
					<Comment>Регистрационный штамп контрагента из внешней системы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВизуализацияЭП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/СлужебныеФайлыДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Делает запись в регистр.
//
// Параметры:
//  Документ - СправочникСсылка.ВнутренниеДокументы, СправочникСсылка.ВходящиеДокументы, СправочникСсылка.ИсходящиеДокументы -
//  Владелец - СправочникСсылка.Файлы, Строка, Неопределено - Файл-владелец служебного файла
//  Отношение - ПеречислениеСсылка.ОтношенияСлужебныхФайлов - пока только одно значение - HTML представление
//  Файл - СправочникСсылка.Файлы -
//  ДополнительныеСведения - Структура - Доп.сведения, например координаты рег.штампа или визуализации подписи.
Процедура ЗаписатьФайл(Документ, Владелец, Отношение, Файл, ДополнительныеСведения = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = СоздатьМенеджерЗаписи();
	
	Запись.Документ = Документ;
	Запись.Владелец = Владелец;
	Запись.Отношение = Отношение;
	Запись.Файл = Файл;
	Запись.ДополнительныеСведения = Новый ХранилищеЗначения(ДополнительныеСведения);
	
	Запись.Записать(Истина);
	
КонецПроцедуры

// Получает служебный файл из регистра. 
// Назначает и неявно возвращает параметр ДополнительныеСведения, если есть.
// 
// Параметры:
//  Документ - СправочникСсылка.ВнутренниеДокументы,
//  		   СправочникСсылка.ВходящиеДокументы,
//  		   СправочникСсылка.ИсходящиеДокументы - Документ
//  Владелец - СправочникСсылка.Файлы, Строка -
//  Отношение - ПеречислениеСсылка.ОтношенияСлужебныхФайлов - Отношение (назначение) служебного файла по отношению к владельцу
//  ДополнительныеСведения - Структура - Дополнительные сведения. Например координаты штампа подписи.
//  									Назначается и неявно возвращается.
// 
// Возвращаемое значение:
//  СправочникСсылка.Файлы, Неопределено - Служебный файл.
Функция ПолучитьСлужебныйФайл(Документ, Владелец, Отношение, ДополнительныеСведения = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// В случае визуализации или штампа в поле Владелец может не быть файла, т.е. визуализация относится ко всему
	// документу, актуально, в частности для МЭДО.
	ВладелецПараметр = ?(
		ЗначениеЗаполнено(Владелец) И ТипЗнч(Владелец) <> Тип("Строка") И ТипЗнч(Владелец) <> Тип("СправочникСсылка.Файлы"), 
		Строка(Владелец), // Могли передать УникальныйИдентификатор, преобразуем его к строке.
		Владелец);
	Владельцы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВладелецПараметр);
	Если Отношение = Перечисления.ОтношенияСлужебныхФайлов.ВизуализацияЭП
		Или Отношение = Перечисления.ОтношенияСлужебныхФайлов.РегистрационныйШтампОрганизации
		Или Отношение = Перечисления.ОтношенияСлужебныхФайлов.РегистрационныйШтампКорреспондента Тогда
		Владельцы.Добавить(Неопределено);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СлужебныеФайлыДокументов.Файл КАК Файл,
		|	СлужебныеФайлыДокументов.ДополнительныеСведения КАК ДополнительныеСведения
		|ИЗ
		|	РегистрСведений.СлужебныеФайлыДокументов КАК СлужебныеФайлыДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО СлужебныеФайлыДокументов.Файл = Файлы.Ссылка
		|ГДЕ
		|	СлужебныеФайлыДокументов.Документ = &Документ
		|	И СлужебныеФайлыДокументов.Владелец В (&Владельцы)
		|	И СлужебныеФайлыДокументов.Отношение = &Отношение
		|	И ЕСТЬNULL(Файлы.ПометкаУдаления, ИСТИНА) = ЛОЖЬ";
		
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Владельцы", Владельцы);
	Запрос.УстановитьПараметр("Отношение", Отношение);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Файл = Неопределено;
	Если Выборка.Следующий() Тогда
		Если Выборка.ДополнительныеСведения <> Неопределено Тогда
			ДополнительныеСведения = Выборка.ДополнительныеСведения.Получить();
		Иначе
			ДополнительныеСведения = Неопределено;
		КонецЕсли;
	
		Файл = Выборка.Файл
	КонецЕсли;
	
	Возврат Файл;
	
КонецФункции

// Получает мастер файл из регистра.
//
// Параметры:
//  Документ - СправочникСсылка.ВнутренниеДокументы
//  Файл - СправочникСсылка.Файлы - служебный файл
//
// Возвращаемое значение:
//  СправочникСсылка.Файлы - файл-владелец
Функция ПолучитьМастерФайл(Документ, Файл) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СлужебныеФайлыДокументов.Владелец КАК Владелец
		|ИЗ
		|	РегистрСведений.СлужебныеФайлыДокументов КАК СлужебныеФайлыДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО СлужебныеФайлыДокументов.Файл = Файлы.Ссылка
		|ГДЕ
		|	СлужебныеФайлыДокументов.Документ = &Документ
		|	И СлужебныеФайлыДокументов.Файл = &Файл
		|	И ЕСТЬNULL(Файлы.ПометкаУдаления, ИСТИНА) = ЛОЖЬ";
		
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Файл", Файл);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Владелец;
	
КонецФункции

// Возвращает файлы пунктов предмета с учетом пометки удаления.
Функция ФайлыВсехПунктов(Предмет) Экспорт
	
	ФайлыВсехПунктов = Новый Соответствие;
	Если Не ЗначениеЗаполнено(Предмет) Тогда
		Возврат ФайлыВсехПунктов;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СлужебныеФайлыДокументов.Владелец КАК Пункт,
		|	СлужебныеФайлыДокументов.Файл КАК Файл
		|ИЗ
		|	РегистрСведений.СлужебныеФайлыДокументов КАК СлужебныеФайлыДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО СлужебныеФайлыДокументов.Файл = Файлы.Ссылка
		|ГДЕ
		|	СлужебныеФайлыДокументов.Документ = &Предмет
		|	И СлужебныеФайлыДокументов.Отношение = ЗНАЧЕНИЕ(Перечисление.ОтношенияСлужебныхФайлов.ФайлПункта)
		|	И Файлы.ПометкаУдаления = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Предмет", Предмет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ФайлыПункта = ФайлыВсехПунктов[Выборка.Пункт];
		Если ФайлыПункта = Неопределено Тогда
			ФайлыВсехПунктов.Вставить(Выборка.Пункт, Новый Массив);
			ФайлыПункта = ФайлыВсехПунктов[Выборка.Пункт];
		КонецЕсли;
		
		ФайлыПункта.Добавить(Выборка.Файл);
		
	КонецЦикла;
	
	Возврат ФайлыВсехПунктов;
	
КонецФункции

// Возвращает файлы пунктов предмета.
Функция ФайлыПунктов(Предмет) Экспорт
	
	ФайлыПунктов = Новый Массив;
	Если Не ЗначениеЗаполнено(Предмет) Тогда
		Возврат ФайлыПунктов;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СлужебныеФайлыДокументов.Файл КАК Файл
		|ИЗ
		|	РегистрСведений.СлужебныеФайлыДокументов КАК СлужебныеФайлыДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО СлужебныеФайлыДокументов.Файл = Файлы.Ссылка
		|ГДЕ
		|	СлужебныеФайлыДокументов.Документ = &Предмет
		|	И СлужебныеФайлыДокументов.Отношение = ЗНАЧЕНИЕ(Перечисление.ОтношенияСлужебныхФайлов.ФайлПункта)
		|	И ЕСТЬNULL(Файлы.ПометкаУдаления, ИСТИНА) = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Предмет", Предмет);
	
	ФайлыПунктов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Файл");
	
	Возврат ФайлыПунктов;
	
КонецФункции

// Возвращает файлы пункта предмета.
Функция ФайлыПункта(Предмет, Пункт) Экспорт
	
	ФайлыПунктов = Новый Массив;
	Если Не ЗначениеЗаполнено(Предмет) Или Не ЗначениеЗаполнено(Пункт) Тогда
		Возврат ФайлыПунктов;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СлужебныеФайлыДокументов.Файл КАК Файл
		|ИЗ
		|	РегистрСведений.СлужебныеФайлыДокументов КАК СлужебныеФайлыДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Файлы КАК Файлы
		|		ПО СлужебныеФайлыДокументов.Файл = Файлы.Ссылка
		|ГДЕ
		|	СлужебныеФайлыДокументов.Документ = &Предмет
		|	И СлужебныеФайлыДокументов.Владелец = &Пункт
		|	И СлужебныеФайлыДокументов.Отношение = ЗНАЧЕНИЕ(Перечисление.ОтношенияСлужебныхФайлов.ФайлПункта)
		|	И ЕСТЬNULL(Файлы.ПометкаУдаления, ИСТИНА) = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Предмет", Предмет);
	Запрос.УстановитьПараметр("Пункт", Пункт);
	
	ФайлыПункта = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Файл");
	
	Возврат ФайлыПункта;
	
КонецФункции

// Устанавливает файл пункта предмета.
Процедура УстановитьФайлПункта(Предмет, Пункт, Файл) Экспорт
	
	Если Не ЗначениеЗаполнено(Предмет) Или Не ЗначениеЗаполнено(Пункт) Или Не ЗначениеЗаполнено(Файл) Тогда
		Возврат;
	КонецЕсли;
	
	Отношение = Перечисления.ОтношенияСлужебныхФайлов.ФайлПункта;
	ЗаписатьФайл(Предмет, Пункт, Отношение, Файл);
	
КонецПроцедуры

// Помечает на удаление файл. Из самого регистра не удаляет, т.к. тогда при включенном показе помеченных на удаление
// служебный файл будет виден в документе на закладке "Файлы".
//
// Параметры:
//  Файл - СправочникСсылка.Файлы -
//
Процедура УдалитьФайл(Файл) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ФайлОбъект = Файл.ПолучитьОбъект();
	ФайлОбъект.ДополнительныеСвойства.Вставить("УдалениеСлужебногоФайла", Истина);
	ФайлОбъект.УстановитьПометкуУдаления(Истина);
	
КонецПроцедуры

// Помечает на удаление файлы по их владельцу и отношению. Сами записи в регистре не удаляет, т.к. служебные
// файлы не должны быть видны в документе на закладке "Файлы" даже при включенном показе удаленных.
//
// Параметры:
//  Документ - СправочникСсылка.ВходящиеДокументы,
//  		   СправочникСсылка.ИсходящиеДокументы,
//  		   СправочникСсылка.ВнутренниеДокументы -
//  Владелец - СправочникСсылка.Файлы, Строка -
//  Отношение - ПеречислениеСсылка.ОтношенияСлужебныхФайлов -
//
Процедура УдалитьПоВладельцуИОтношению(Документ, Владелец, Отношение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СлужебныеФайлыДокументов.Файл КАК Файл
		|ИЗ
		|	РегистрСведений.СлужебныеФайлыДокументов КАК СлужебныеФайлыДокументов
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	Справочник.Файлы КАК Файлы
		|		ПО СлужебныеФайлыДокументов.Файл = Файлы.Ссылка
		|ГДЕ
		|	СлужебныеФайлыДокументов.Документ = &Документ
		|	И СлужебныеФайлыДокументов.Владелец = &Владелец
		|	И СлужебныеФайлыДокументов.Отношение = &Отношение
		|	И ЕСТЬNULL(Файлы.ПометкаУдаления, ИСТИНА) = ЛОЖЬ");
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Отношение", Отношение);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		УдалитьФайл(Выборка.Файл);
	КонецЦикла;
	
КонецПроцедуры

// Помечает на удаление служебные файлы картинок документа
//
// Параметры:
//  Документ - СправочникСсылка.ВнутренниеДокументы
//
Процедура ОчиститьКартинки(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СлужебныеФайлыДокументов.Владелец КАК Владелец,
		|	СлужебныеФайлыДокументов.Документ КАК Документ,
		|	СлужебныеФайлыДокументов.Файл КАК Файл
		|ИЗ
		|	РегистрСведений.СлужебныеФайлыДокументов КАК СлужебныеФайлыДокументов
		|ГДЕ
		|	СлужебныеФайлыДокументов.Документ = &Документ
		|	И СлужебныеФайлыДокументов.Отношение = &Отношение";
		
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Отношение", Перечисления.ОтношенияСлужебныхФайлов.Картинка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	
	Попытка
		
		НачатьТранзакцию();
	
		Пока Выборка.Следующий() Цикл
			
			ФайлОбъект = Выборка.Файл.ПолучитьОбъект();
			ФайлОбъект.ДополнительныеСвойства.Вставить("УдалениеСлужебногоФайла", Истина);
			ФайлОбъект.УстановитьПометкуУдаления(Истина);
			
		КонецЦикла;	
	
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
